#include <stdio.h>
#include <math.h>
#include <locale.h>
#include <windows.h>

int main()
{
	// Встановити українську локаль
	setlocale(LC_ALL, "ukr");

	// Встановити кодування UTF-8 для консолі Windows
	SetConsoleOutputCP(CP_UTF8);
	SetConsoleCP(CP_UTF8);

	// | Завдання 1 |

	int a1 = 2, b1 = -4, c1 = -6;
	float x1 = 0.0, x2 = 0.0;

	printf("| Завдання 1 |\n\tДано квадратне рівняння ax^2 + bx + c = 0 яке треба обчислити за формулою:\n\tx1, x2 = (-b +- sqrt(b^2 - 4ac)) / 2a\n\tВхідні дані: a = 2, b = -4, c = -6\n");
	/* Можна розкоментувати цей блок, щоб вводити дані з консолі
	scanf("%d", a1);
	scanf("%d", b1);
	scanf("%d", c1);*/

	x1 = (-b1 + sqrt(b1 * b1 - 4 * a1 * c1)) / (2 * a1);
	x2 = (-b1 - sqrt(b1 * b1 - 4 * a1 * c1)) / (2 * a1);

	printf("| Відповідь: x1 = %.2f, x2 = %.2f\n\n", x1, x2);

	// | Завдання 2 |

	int a2 = 5, b2 = 7, c2 = 8;
	float p = 0.0, s = 0.0;

	printf("| Завдання 2 |\n\tДля трикутника з довжинами сторін a, b, c треба використати формулу Герона для обчислення площі:\n\tS = sqrt(p(p - a)(p - b)(p - c))\n\tде p = (a + b + c)/2 - півпериметр трикутника\n\tВхідні дані: a = 5, b = 7, c = 8\n");
	/* Можна розкоментувати цей блок, щоб вводити дані з консолі
		scanf("%d", a2);
		scanf("%d", b2);
		scanf("%d", c2);*/

	p = (a2 + b2 + c2) / 2;
	s = sqrt(p * (p - a2) * (p - b2) * (p - c2));

	printf("| Відповідь: S = %.2f\n\n", s);

	// | Завдання 3 |

	int n = 10, a3 = 3, d = 2;
	float Sn = 0.0;

	printf("| Завдання 3 |\n\tОбчислення суми перших n елементів арифметичної прогресії за формулою:\n\tSn = (n/2) * (2a1 + (n - 1) * d)\n\tде a1 - перший член прогресії, d - різниця прогресії, n - кількість членів\n\tВхідні дані: a = 5, b = 7, c = 8\n");
	/* Можна розкоментувати цей блок, щоб вводити дані з консолі
	scanf("%d", n);
	scanf("%d", a3);
	scanf("%d", d);*/

	Sn = (n / 2.0) * (2 * a3 + (n - 1) * d);

	printf("| Відповідь: Sn = %.2f\n\n", Sn);

	return 0;
}
